[
    {
        "title": "Software Developer",
        "id": "dev-fulltime",
        "current": true,
        "contributions": [
            "Developed and maintained tools that were both internal and client-facing.",
            "Contributed to open source Angular component library.",
            "databricks stuff",
            "Python lib",
            "Deployment pipeline",
            "Azure Data Factory",
            "Interoperability with external systems",
            "Azure Functions (serverless)",
            "Tooling and monitoring software.",
            "Chaired a committee that lead monthly learning sessions."
        ]
    },
    {
        "title": "Code:You Mentor",
        "id": "mentor",
        "current": true,
        "contributions": [
            "taught code",
            "Reviewed code",
            "created additional learning materials "
        ]
    },
    {
        "title": "Personal",
        "id": "personal",
        "current": true,
        "contributions": [
            "Committed to daily Spanish language training through Babel and Doulingo.",
            "Committed to daily, MEANINGFUL commits/contribution to personal code projects OR daily meaningful time working on Blender art."
        ]
    },
    {
        "title": "ICU Nurse",
        "id": "nurse",
        "current": false,
        "contributions": [
            "Sought additional training certifications in Pediatric Advanced Life Support (PALS) as well as training in PRISMA.",
            "Managed life support equipment and worked with multidisciplinary teammates to deliver compassionate care for families and critically ill patients with debilitating conditions or injuries.",
            "Assessed conditions, symptoms, diagnostic tests, and behaviors of pediatric patients to monitor for life-altering changes, responded using quick critical thinking skills, and worked well with multi-disciplinary teams.",
            "Responded to rapid changes in patient condition, worked well under pressure, and exercised excellent time management skills with multiple patient assignments.",
            "Lead a Council of my peers to innovate and improve nursing practice.",
            "Followed policies and procedures regarding patient privacy and information detailed in HIPAA.",
            "Adapted quickly to new patient populations, hospital, policies, and procedures to provide support for staff at another (adult) hospital in the same system while they were stretched thin during the COVID-19 pandemic.",
            "Aided in hospital logistics including moving patients, closing units, and arrangement of nursing assignments."
        ]
    },
    {
        "title": "Software Dev Intern",
        "id": "dev-intern",
        "current": false,
        "contributions": [
            "Updated a large production application from Angular 10 to Angular 12 in a timely manner.",
            "Implemented a quality-of-life update by adding a REST API endpoint to return information on previously added sets of data.",
            "Gained experience working in Azure DevOps, Snowflake Data Cloud, and Azure services.",
            "large scale software deployment 'ring-style'",
            "Collaborated with a team of software engineers by pairing on projects, reviewing code, and working through solutions to difficult healthcare-related problems"
        ]
    },
    {
        "title": "Code:You Student",
        "id": "dev-student",
        "current": false,
        "contributions": [
            "Learned things",
            "soaked in as much knowledge as I could",
            "Churned out learning projects",
            "went above and beyond",
            "Web, Web2, C#, Kotlin",
            "Wrote (bad) code",
            "Made a pokemon app or two"
        ]
    },
    {
        "title": "Maintenance",
        "id": "mainenance",
        "current": false,
        "contributions": [
            "Committed to daily Spanish language training through Babel and Doulingo.",
            "Committed to daily, MEANINGFUL commits/contribution to personal code projects OR daily meaningful time working on Blender art."
        ]
    },
    {
        "title": "Awards",
        "id": "awards",
        "current": false,
        "contributions": [
            "Pokemon Master",
            "Nurse of the Year Finalist",
            "Presgany"
        ]
    }
]